## Plan Result (prod_app_registrations - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS Recipe Receiver testing-Reader-/providers/Microsoft.Management/managementGroups/CFT-Prod&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Recipe Receiver testing-Reader-/providers/Microsoft.Management/managementGroups/SDS-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS Recipe Receiver testing-Reader-/providers/Microsoft.Management/managementGroups/CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee16a4e6-dc33-4270-bffe-85515a2a6ccb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Recipe Receiver testing-Reader-/providers/Microsoft.Management/managementGroups/SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee16a4e6-dc33-4270-bffe-85515a2a6ccb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label prod_app_registrations - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-github-federation-config/issues/71/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":71,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations - TerraformPlanApply","Vars":{}} -->